# Classement des Universités

In [1]:
import pandas as pd
import numpy as np

## Fichier : educational_attainment_supplementary_data.csv

Familiarisation avec les données : info, describe ...

In [2]:
df_eas = pd.read_csv("./archive/educational_attainment_supplementary_data.csv")

In [3]:
df_eas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79055 entries, 0 to 79054
Data columns (total 29 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country_name  79052 non-null  object
 1   series_name   79050 non-null  object
 2   1985          51843 non-null  float64
 3   1986          12 non-null     float64
 4   1987          3 non-null      float64
 5   1990          51846 non-null  float64
 6   1991          1 non-null      float64
 7   1992          3 non-null      float64
 8   1993          1 non-null      float64
 9   1995          51884 non-null  float64
 10  1996          3 non-null      float64
 11  1997          0 non-null      float64
 12  1998          47 non-null     float64
 13  1999          9 non-null      float64
 14  2000          51970 non-null  float64
 15  2001          225 non-null    float64
 16  2002          184 non-null    float64
 17  2003          55 non-null     float64
 18  2004          137 non-null    float64
 19  2005          52037 non-null  float64
 20  2006          204 non-null    float64
 21  2007          286 non-null    float64
 22  2008          366 non-null    float64
 23  2009          464 non-null    float64
 24  2010          52796 non-null  float64
 25  2011          929 non-null    float64
 26  2012          1106 non-null   float64
 27  2013          1879 non-null   float64
 28  2015          0 non-null      float64
dtypes: float64(27), object(2)
memory usage: 17.5+ MB

In [4]:
df_eas.describe()

,1985,1986,1987,1990,1991,1992,1993,1995,1996,1997,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
count,51843.000000,12.000000,3.000000,51846.000000,1.00000,3.000000,1.00000,51884.000000,3.00000,0.0,...,5.203700e+04,204.000000,286.000000,366.000000,464.000000,5.279600e+04,929.000000,1106.000000,1879.000000,0.0
mean,253.059289,6.365242,1.988220,280.061650,7.58463,5.758003,6.22103,306.774826,7.79931,NaN,...,3.635199e+02,13.172861,16.073780,14.849021,17.527544,3.866418e+02,20.351652,19.483375,23.113742,NaN
std,5812.705429,2.335996,0.883044,6525.945102,NaN,0.244010,NaN,7192.240329,0.30145,NaN,...,8.563497e+03,14.756343,22.696642,17.947568,22.434285,9.146338e+03,25.186301,24.036373,28.481772,NaN
min,0.000000,3.740600,1.118970,0.000000,7.58463,5.514150,6.22103,0.000000,7.49769,NaN,...,0.000000e+00,0.129330,0.000000,0.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000,NaN
25%,1.020000,4.841200,1.540110,1.230000,7.58463,5.635920,6.22103,1.540000,7.64867,NaN,...,1.930000e+00,5.855385,3.057243,5.408055,4.462345,2.010000e+00,2.743710,1.498102,1.050885,NaN
50%,5.070000,5.581280,1.961250,5.670000,7.58463,5.757690,6.22103,6.250000,7.79965,NaN,...,7.250000e+00,8.623460,9.234600,9.460645,10.165165,7.470000e+00,10.797220,10.602820,11.875010,NaN
75%,23.245000,7.255653,2.422845,24.100000,7.58463,5.879930,6.22103,24.860000,7.95012,NaN,...,2.641000e+01,15.203413,16.020193,14.590020,17.457818,2.700000e+01,25.529380,26.929520,31.535075,NaN
max,745898.000000,10.192880,2.884440,835430.000000,7.58463,6.002170,6.22103,896920.000000,8.10059,NaN,...,1.034076e+06,93.687040,99.993050,97.702760,98.721210,1.090693e+06,99.521370,98.676980,100.000000,NaN

In [5]:
df_eas.head(2)

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN

In [6]:
df_eas.groupby(['country_name']).count()

,series_name,1985,1986,1987,1990,1991,1992,1993,1995,1996,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
country_name,,,,,,,,,,,,,,,,,,,,,
Afghanistan,425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,0,360,0,0,0,0
Albania,425,360,0,0,360,0,0,0,360,0,...,360,0,0,3,0,360,3,62,0,0
Algeria,425,360,0,0,360,0,0,0,360,0,...,360,30,0,0,0,360,0,0,0,0
Andorra,425,0,0,0,0,0,0,0,0,0,...,0,34,0,0,0,0,0,0,0,0
Argentina,425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,0,360,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam,425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,37,360,0,0,0,0
West Bank and Gaza,425,0,0,0,0,0,0,0,0,0,...,0,3,1,3,3,3,3,3,55,0
"Yemen, Rep.",425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,0,360,0,0,0,0
Zambia,425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,0,360,0,0,0,0
Zimbabwe,425,360,0,0,360,0,0,0,360,0,...,360,0,0,0,0,360,0,37,0,0

In [7]:
df_eas[df_eas['country_name']=='France']

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
25075,France,"Barro-Lee: Average years of primary schooling,...",4.09,NaN,NaN,4.18,NaN,NaN,NaN,4.50,...,4.82,NaN,NaN,NaN,NaN,4.89,NaN,NaN,NaN,NaN
25076,France,"Barro-Lee: Average years of primary schooling,...",4.11,NaN,NaN,4.20,NaN,NaN,NaN,4.52,...,4.84,NaN,NaN,NaN,NaN,4.89,NaN,NaN,NaN,NaN
25077,France,"Barro-Lee: Average years of primary schooling,...",4.33,NaN,NaN,4.57,NaN,NaN,NaN,4.73,...,4.95,NaN,NaN,NaN,NaN,5.00,NaN,NaN,NaN,NaN
25078,France,"Barro-Lee: Average years of primary schooling,...",4.29,NaN,NaN,4.52,NaN,NaN,NaN,4.71,...,4.94,NaN,NaN,NaN,NaN,4.98,NaN,NaN,NaN,NaN
25079,France,"Barro-Lee: Average years of primary schooling,...",4.56,NaN,NaN,4.71,NaN,NaN,NaN,4.86,...,4.97,NaN,NaN,NaN,NaN,4.92,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25495,France,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.42768,NaN,NaN
25496,France,UIS: Percentage of population age 25+ with som...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.54883,NaN,NaN
25497,France,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.00000,NaN,NaN
25498,France,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.00000,NaN,NaN
25499,France,UIS: Percentage of population age 25+ with unk...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.00000,NaN,NaN

#### Ce fichier donne le niveau d'éducation de la population par pays (tranche d'age / années d'études) en proportion

## Fichier : education_expenditure_supplementary_data.csv

Familiarisation avec les données : info, describe ...

In [8]:
df_ees = pd.read_csv("./archive/education_expenditure_supplementary_data.csv", engine='python')

In [9]:
df_ees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 333 entries, 0 to 332
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   country                  333 non-null    object
 1   institute_type           333 non-null    object
 2   direct_expenditure_type  333 non-null    object
 3   1995                     94 non-null     float64
 4   2000                     99 non-null     float64
 5   2005                     106 non-null    float64
 6   2009                     103 non-null    float64
 7   2010                     101 non-null    float64
 8   2011                     282 non-null    float64
dtypes: float64(6), object(3)
memory usage: 23.5+ KB

In [10]:
df_ees.describe().transpose()

      count      mean       std  min   25%   50%   75%  max
1995   94.0  3.106383  1.790465  0.1  1.10  3.40  4.50  6.8
2000   99.0  3.062626  1.725475  0.5  1.20  3.30  4.35  6.6
2005  106.0  3.142453  1.752329  0.3  1.20  3.45  4.30  7.2
2009  103.0  3.388350  1.869534  0.3  1.35  3.70  4.85  7.5
2010  101.0  3.392079  1.883119  0.5  1.30  3.60  4.80  7.6
2011  282.0  2.573050  2.130673  0.0  0.70  1.75  4.30  7.9

In [11]:
df_ees.head(2)

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3

In [12]:
df_ees[df_ees['country']=='France']

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
10,France,All Institutions,Public,5.8,5.7,5.6,5.8,5.8,5.6
47,France,Elementary and Secondary Institutions,Public,4.1,4.0,3.8,3.8,3.8,3.7
84,France,Higher Education Institutions,Public,1.0,1.0,1.1,1.3,1.3,1.3
121,France,All Institutions,Private,NaN,NaN,NaN,NaN,NaN,0.5
158,France,Elementary and Secondary Institutions,Private,NaN,NaN,NaN,NaN,NaN,0.3
195,France,Higher Education Institutions,Private,NaN,NaN,NaN,NaN,NaN,0.2
232,France,All Institutions,Total,NaN,NaN,NaN,NaN,NaN,6.1
269,France,Elementary and Secondary Institutions,Total,NaN,NaN,NaN,NaN,NaN,3.9
306,France,Higher Education Institutions,Total,NaN,NaN,NaN,NaN,NaN,1.5

Ce fichier donne la part de la dépense dans l'éducation par pays et par niveau d'institution et par source (public / privé), par rapport au budget domestique

## Fichier : school_and_country_table.csv

In [13]:
df_sct = pd.read_csv('./archive/school_and_country_table.csv')

In [14]:
df_sct.head(2)

                          school_name                   country
0                  Harvard University  United States of America
1  California Institute of Technology  United States of America

Ce fichier sert à compléter les données manquantes du timesData.csv

## Fichier : cwurData.csv

In [15]:
df_cd = pd.read_csv("./archive/cwurData.csv")

In [16]:
df_cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   institution           2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

In [17]:
df_cd.head(2)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012

In [18]:
df_cd.tail(2)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [19]:
df_cd.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
world_rank,2200.0,459.590909,304.320363,1.00,175.75,450.5,725.250,1000.0
national_rank,2200.0,40.278182,51.740870,1.00,6.00,21.0,49.000,229.0
quality_of_education,2200.0,275.100455,121.935100,1.00,175.75,355.0,367.000,367.0
alumni_employment,2200.0,357.116818,186.779252,1.00,175.75,450.5,478.000,567.0
quality_of_faculty,2200.0,178.888182,64.050885,1.00,175.75,210.0,218.000,218.0
publications,2200.0,459.908636,303.760352,1.00,175.75,450.5,725.000,1000.0
influence,2200.0,459.797727,303.331822,1.00,175.75,450.5,725.250,991.0
citations,2200.0,413.417273,264.366549,1.00,161.00,406.0,645.000,812.0
broad_impact,2000.0,496.699500,286.919755,1.00,250.50,496.0,741.000,1000.0
patents,2200.0,433.346364,273.996525,1.00,170.75,426.0,714.250,871.0
score,2200.0,47.798395,7.760806,43.36,44.46,45.1,47.545,100.0
year,2200.0,2014.318182,0.762130,2012.00,2014.00,2014.0,2015.000,2015.0

In [20]:
df_cd['institution'].value_counts()

Swiss Federal Institute of Technology in Zurich    4
University of Sydney                               4
McGill University                                  4
University of Rochester                            4
University of Manchester                           4
                                                  ..
École centrale de Lyon                             1
National Dong Hwa University                       1
I-Shou University                                  1
Zhejiang Normal University                         1
Williams College                                   1
Name: institution, Length: 1024, dtype: int64

Ce fichier liste les universités classées dans le top 1000 entre 2012 et 2015 d'après le classement cwur (Saudi Arabia)

## Fichier : shanghaiData.csv

In [21]:
df_sd = pd.read_csv('./archive/shanghaiData.csv')

In [22]:
df_sd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4897 entries, 0 to 4896
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   world_rank       4897 non-null   object
 1   university_name  4896 non-null   object
 2   national_rank    4896 non-null   object
 3   total_score      1101 non-null   float64
 4   alumni           4896 non-null   float64
 5   award            4895 non-null   float64
 6   hici             4895 non-null   float64
 7   ns               4875 non-null   float64
 8   pub              4895 non-null   float64
 9   pcp              4895 non-null   float64
 10  year             4897 non-null   int64
dtypes: float64(7), int64(1), object(3)
memory usage: 421.0+ KB

In [23]:
df_sd.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_score,1101.0,36.383470,13.557186,23.5,27.4,31.3,41.8,100.0
alumni,4896.0,9.161724,14.140636,0.0,0.0,0.0,15.6,100.0
award,4895.0,7.691910,15.494110,0.0,0.0,0.0,13.4,100.0
hici,4895.0,16.221491,14.382710,0.0,7.3,12.6,21.7,100.0
ns,4875.0,16.078503,12.511529,0.0,8.0,12.8,19.8,100.0
pub,4895.0,38.254648,13.050809,7.3,28.9,36.0,45.3,100.0
pcp,4895.0,21.242329,9.254351,8.3,15.6,19.0,24.5,100.0
year,4897.0,2009.658566,3.197576,2005.0,2007.0,2009.0,2012.0,2015.0

In [24]:
df_sd.head(4)

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005

Ce fichier est le classement des universités d'après le classement Shanghai entre 2005 et 2015

## Fichier timesData.csv

In [25]:
df_td = pd.read_csv('./archive/timesData.csv')

In [26]:
df_td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [27]:
df_td.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
teaching,2603.0,37.801498,17.604218,9.9,24.700,33.9,46.40,99.7
research,2603.0,35.910257,21.254805,2.9,19.600,30.5,47.25,99.4
citations,2603.0,60.921629,23.073219,1.2,45.500,62.5,79.05,100.0
student_staff_ratio,2544.0,18.445283,11.458698,0.6,11.975,16.1,21.50,162.6
year,2603.0,2014.075682,1.685733,2011.0,2013.000,2014.0,2016.00,2016.0

In [28]:
df_td.head(4)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011

Ce fichier donne le classement des université d'après le classement THE (UK)

In [29]:
#

# Questions spécifiques

### Quelles années sont prises en charge par chaque classement ?

(voir les describe() plus haut)

cwur : 2012-2015  
shanghai : 2005-2015  
times : 2011-2015

### Combien d'universités sont prises en compte annuellement par chaque classement en moyenne ? Il s'agit ici de donner le nombre moyen d'universités prises en compte par chaque classement lors d'une année.

In [30]:
print("CWUR:")
for i in range(2012,2016):
    count = df_cd[df_cd['year'] == i].groupby('institution').count().shape[0]
    print(f'année {i} : {count} universités classées')

CWUR:
année 2012 : 100 universités classées
année 2013 : 100 universités classées
année 2014 : 1000 universités classées
année 2015 : 1000 universités classées

In [31]:
print("shanghai:")
for i in range(2005,2016):
    count = df_sd[df_sd['year']== i].groupby('university_name').count().shape[0]
    print(f'année {i} : {count} universités classées')

shanghai:
année 2005 : 500 universités classées
année 2006 : 500 universités classées
année 2007 : 508 universités classées
année 2008 : 501 universités classées
année 2009 : 501 universités classées
année 2010 : 498 universités classées
année 2011 : 500 universités classées
année 2012 : 284 universités classées
année 2013 : 98 universités classées
année 2014 : 500 universités classées
année 2015 : 500 universités classées

In [32]:
print("Times:")
for i in range(2011,2016):
    count = df_sd[df_sd['year'] == i].groupby('university_name').count().shape[0]
    print(f'année {i} : {count} universités classées')

Times:
année 2011 : 500 universités classées
année 2012 : 284 universités classées
année 2013 : 98 universités classées
année 2014 : 500 universités classées
année 2015 : 500 universités classées

In [33]:

for i in range(2012,2016):
    ccount = df_cd[df_cd['year'] == i].groupby('institution').count().shape[0]
    tcount = df_td[df_td['year'] == i].groupby('university_name').count().shape[0]
    scount = df_sd[df_sd['year']== i].groupby('university_name').count().shape[0]
    print(f'année {i} : {round((ccount + tcount + scount) / 3)} universités classées en moyenne')

année 2012 : 262 universités classées en moyenne
année 2013 : 199 universités classées en moyenne
année 2014 : 633 universités classées en moyenne
année 2015 : 634 universités classées en moyenne

 ### Quels sont les rankings obtenus par l'Université de Strabsourg dans chacun des 3 classements disponibles ?

In [34]:
print("Strasbourg CWUR:")
df_cd[df_cd['institution'].str.contains("Strasbourg")][['institution','year','world_rank']]

Strasbourg CWUR:

                   institution  year  world_rank
375   University of Strasbourg  2014         176
1381  University of Strasbourg  2015         182

In [35]:
print("Strasbourg Shanghai:")
sd_nona = df_sd[df_sd['university_name'].isna()==False]
sd_nona[sd_nona['university_name'].str.contains('Strasbourg')][['university_name','year', 'world_rank']]

Strasbourg Shanghai:

               university_name  year world_rank
91    University of Strasbourg  2005         92
595   University of Strasbourg  2006         96
1100  University of Strasbourg  2007         99
1656  University of Strasbourg  2008    101-151
2158  University of Strasbourg  2009    101-151
2657  University of Strasbourg  2010    101-150
3157  University of Strasbourg  2011    102-150
3659  University of Strasbourg  2012    101-150
3894  University of Strasbourg  2013         97
3991  University of Strasbourg  2014         95
4485  University of Strasbourg  2015         87

In [36]:
print("Strasbourg Times:")
df_td[df_td['university_name'].str.contains("Strasbourg")][['university_name','year','world_rank']]

Strasbourg Times:

               university_name  year world_rank
422   University of Strasbourg  2012    201-225
825   University of Strasbourg  2013    201-225
1223  University of Strasbourg  2014    201-225
1619  University of Strasbourg  2015    201-225
2142  University of Strasbourg  2016    301-350

 ### Selon le classement du Times, quels sont les 20 meilleures universités en 2016 ? Quelle est la part d'universités américaines ?

In [37]:
top_20 = df_td[df_td['year'] == 2016].head(20)
top_20

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,"2,243",6.9,27%,33 : 67,2016
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,"19,919",11.6,34%,46 : 54,2016
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,"15,596",7.8,22%,42 : 58,2016
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,"18,812",11.8,34%,46 : 54,2016
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,"11,074",9.0,33%,37 : 63,2016
1808,6,Harvard University,United States of America,83.6,77.2,99.0,99.8,45.2,91.6,"20,152",8.9,25%,NaN,2016
1809,7,Princeton University,United States of America,85.1,78.5,91.9,99.3,52.1,90.1,"7,929",8.4,27%,45 : 55,2016
1810,8,Imperial College London,United Kingdom,83.3,96.0,88.5,96.7,53.7,89.1,"15,060",11.7,51%,37 : 63,2016
1811,9,ETH Zurich – Swiss Federal Institute of Techno...,Switzerland,77.0,97.9,95.0,91.1,80.0,88.3,"18,178",14.7,37%,31 : 69,2016
1812,10,University of Chicago,United States of America,85.7,65.0,88.9,99.2,36.6,87.9,"14,221",6.9,21%,42 : 58,2016
1813,11,Johns Hopkins University,United States of America,77.6,70.0,90.4,98.2,100.0,87.6,"15,128",3.6,23%,50 : 50,2016
1814,12,Yale University,United States of America,86.5,64.3,87.8,97.2,43.3,87.4,"11,751",4.4,20%,50 : 50,2016
1815,13,"University of California, Berkeley",United States of America,80.4,61.9,91.1,99.7,47.9,87.2,"36,186",16.4,15%,50 : 50,2016
1816,14,University College London,United Kingdom,78.1,94.4,91.0,94.2,40.5,87.1,"26,607",10.7,46%,56 : 44,2016
1817,15,Columbia University,United States of America,85.9,73.5,82.2,98.1,-,86.1,"25,055",5.9,28%,NaN,2016
1818,16,"University of California, Los Angeles",United States of America,80.8,56.4,88.6,98.5,47.9,85.8,"38,206",10.3,15%,52 : 48,2016
1819,17,University of Pennsylvania,United States of America,82.0,49.5,86.9,98.6,47.9,85.2,"20,376",6.5,20%,51 : 49,2016
1820,18,Cornell University,United States of America,77.9,63.9,86.1,97.2,33.7,84.0,"21,424",10.2,19%,48 : 52,2016
1821,19,University of Toronto,Canada,75.9,77.8,89.3,90.9,49.1,83.9,"66,198",19.5,15%,NaN,2016
1822,20,Duke University,United States of America,76.0,56.5,78.0,99.0,100.0,82.7,"15,172",4.8,17%,49 : 51,2016

In [38]:
top_20.groupby('country').count().sort_values('world_rank', ascending = False)['world_rank']

country
United States of America    14
United Kingdom               4
Canada                       1
Switzerland                  1
Name: world_rank, dtype: int64

14 universités américaines dans le top 20 de 2016

### Combien chaque pays possède d'universités dans le classement de Shanghai en 2015 ? Range la liste par ordre décroissant. Pense à t'aider de la table université - pays pour réaliser cette requête.

In [39]:
df_sct.head(2)

                          school_name                   country
0                  Harvard University  United States of America
1  California Institute of Technology  United States of America

In [40]:
df_sd_complete = df_sd.set_index('university_name').join(df_sct.set_index('school_name'))

In [41]:
df_sd_complete[df_sd_complete['year'] == 2015].groupby('country').count().sort_values(by='year', ascending=False)['year']

country
United States of America    90
United Kingdom              26
China                       22
Canada                      16
Italy                       15
Germany                     14
Japan                       14
Australia                   13
Spain                       12
Netherlands                 10
South Korea                  9
Sweden                       8
Taiwan                       6
Austria                      5
Denmark                      5
Switzerland                  5
France                       5
Finland                      5
South Africa                 4
Belgium                      3
Portugal                     3
Israel                       3
Brazil                       3
Republic of Ireland          3
Singapore                    2
Saudi Arabia                 2
Poland                       2
Norway                       2
Iran                         2
Greece                       2
Egypt                        1
Russian Federation           1
Serbia                       1
New Zealand                  1
Slovenia                     1
Chile                        1
India                        1
Hungary                      1
Hong Kong                    1
Turkey                       1
Czech Republic               1
Mexico                       1
Name: year, dtype: int64

### Quelles sont les universités françaises présentes dans le classement du Center for WUR ?

In [42]:
df_cd[df_cd['country']=='France'].groupby('institution').count().index.tolist()

['Aix-Marseille University',
 'Blaise Pascal University',
 'Claude Bernard University Lyon 1',
 'Grenoble Institute of Technology',
 'Institut national des sciences Appliquées de Lyon',
 'Jean Monnet University',
 'Joseph Fourier University',
 'Lille 2 University of Health and Law',
 'Mines ParisTech',
 'National Polytechnic Institute of Toulouse',
 'Paris Descartes University',
 'Paris Diderot University - Paris 7',
 'Paris-Est Créteil Val-de-Marne University',
 'Paul Sabatier University - Toulouse III',
 'Paul Valéry University, Montpellier III',
 'Pierre-and-Marie-Curie University',
 'University François Rabelais, Tours',
 'University Lille 1: Sciences and Technologies',
 'University of Angers',
 'University of Bordeaux',
 'University of Bordeaux I',
 'University of Bordeaux II',
 'University of Burgundy',
 'University of Caen Lower Normandy',
 'University of Franche-Comté',
 'University of Lorraine',
 'University of Maine (Le Mans)',
 'University of Montpellier',
 'University of Montpellier 1',
 'University of Montpellier 2',
 'University of Nantes',
 'University of Nice Sophia Antipolis',
 'University of Orléans',
 'University of Paris 13',
 'University of Paris-Sud',
 "University of Pau and Pays de l'Adour",
 'University of Perpignan Via Domitia',
 'University of Picardie Jules Verne',
 'University of Poitiers',
 'University of Reims Champagne-Ardenne',
 'University of Rennes 1',
 'University of Rouen',
 'University of Savoy',
 'University of Strasbourg',
 'University of Valenciennes and Hainaut-Cambresis',
 'University of Western Brittany',
 "University of Évry Val d'Essonne",
 'Versailles Saint-Quentin-en-Yvelines University',
 'École Centrale Paris',
 'École Polytechnique',
 'École centrale de Lyon',
 'École normale supérieure - Paris',
 'École normale supérieure de Cachan',
 'École normale supérieure de Lyon']

### Quels pays ont les plus faibles ratios (Dépenses dans les Institutions du Supérieur (Privées et Publiques) en 2011) / Nombre d'universités dans le classement du Times en 2011 ? Range cette liste par ordre croissant.

récupérons le classement et dépouillons le des infos qui ne sont pas pertinentes.  
nous garderons seulement le compte par pays pour l'année 2011

In [43]:
countries_2011 = (df_td[df_td['year']==2011].groupby('country').count())
countries_2011['count'] = countries_2011['world_rank']
c_2011 = pd.DataFrame(countries_2011['count'])
c_2011

                          count
country
Australia                     7
Austria                       2
Belgium                       2
Canada                        9
China                         6
Denmark                       3
Egypt                         1
Finland                       1
France                        4
Germany                      14
Hong Kong                     4
Japan                         5
Netherlands                  10
New Zealand                   1
Norway                        1
Republic of Ireland           2
Singapore                     2
South Africa                  1
South Korea                   4
Spain                         2
Sweden                        6
Switzerland                   6
Taiwan                        4
Turkey                        2
United Kingdom               29
United States of America     72

Pareillement, gardons les seules data qui nous nous intéressent pour les dépenses.  
nous gardon les dépenses par pays pour l'année 2011 correspondant à l'éducation supérieure, privée et publique

In [44]:
ees_2011 = df_ees[df_ees['institute_type'].str.startswith('Higher')][['country', '2011', 'direct_expenditure_type']]
ees_2011 = ees_2011[ees_2011['direct_expenditure_type'] == 'Total']
ees_2011 = ees_2011.set_index('country')
ees_2011.drop('direct_expenditure_type', axis=1, inplace=True)
ees_2011

                      2011
country
OECD Average           1.6
Australia              1.6
Austria                1.5
Belgium                1.4
Canada                 NaN
Chile                  2.4
Czech Republic         1.4
Denmark                1.9
Estonia                1.7
Finland                1.9
France                 1.5
Germany                1.3
Greece                 NaN
Hungary                NaN
Iceland                1.2
Ireland                1.5
Israel                 1.7
Italy                  1.0
Japan                  1.6
Korea, Republic of     2.6
Luxembourg             NaN
Mexico                 1.3
Netherlands            1.8
New Zealand            1.5
Norway                 1.7
Poland                 1.3
Portugal               1.4
Slovak Republic        1.0
Slovenia               1.3
Spain                  1.3
Sweden                 1.7
Switzerland            NaN
Turkey                 NaN
United Kingdom         1.2
United States          2.7
  Brazil               NaN
  Russian Federation   1.4

les noms des pays ne correspondent pas totalement entre le classement et les dépenses et certains sont manquant  
Nous allons en normaliser quelques uns

In [45]:
c_2011.index.to_list()

['Australia',
 'Austria',
 'Belgium',
 'Canada',
 'China',
 'Denmark',
 'Egypt',
 'Finland',
 'France',
 'Germany',
 'Hong Kong',
 'Japan',
 'Netherlands',
 'New Zealand',
 'Norway',
 'Republic of Ireland',
 'Singapore',
 'South Africa',
 'South Korea',
 'Spain',
 'Sweden',
 'Switzerland',
 'Taiwan',
 'Turkey',
 'United Kingdom',
 'United States of America']

In [46]:
ees_2011.index.to_list()

['OECD Average',
 'Australia',
 'Austria',
 'Belgium',
 'Canada',
 'Chile',
 'Czech Republic',
 'Denmark',
 'Estonia',
 'Finland',
 'France',
 'Germany',
 'Greece',
 'Hungary',
 'Iceland',
 'Ireland',
 'Israel',
 'Italy',
 'Japan',
 'Korea, Republic of',
 'Luxembourg',
 'Mexico',
 'Netherlands',
 'New Zealand',
 'Norway',
 'Poland',
 'Portugal',
 'Slovak Republic',
 'Slovenia',
 'Spain',
 'Sweden',
 'Switzerland',
 'Turkey',
 'United Kingdom',
 'United States',
 '  Brazil',
 '  Russian Federation']

In [47]:
ees_2011.rename(index={'Ireland' : 'Republic of Ireland', 'United States' : 'United States of America'}, inplace = True)

In [48]:
result = pd.merge(c_2011, ees_2011, left_index=True, right_index=True)
result['ratio'] = result['2011']/result['count']
result.sort_values(by='ratio', ascending=True)

                          count  2011     ratio
country
United States of America     72   2.7  0.037500
United Kingdom               29   1.2  0.041379
Germany                      14   1.3  0.092857
Netherlands                  10   1.8  0.180000
Australia                     7   1.6  0.228571
Sweden                        6   1.7  0.283333
Japan                         5   1.6  0.320000
France                        4   1.5  0.375000
Denmark                       3   1.9  0.633333
Spain                         2   1.3  0.650000
Belgium                       2   1.4  0.700000
Austria                       2   1.5  0.750000
Republic of Ireland           2   1.5  0.750000
New Zealand                   1   1.5  1.500000
Norway                        1   1.7  1.700000
Finland                       1   1.9  1.900000
Canada                        9   NaN       NaN
Switzerland                   6   NaN       NaN
Turkey                        2   NaN       NaN

In [49]:
c_2011.shape[0]

26

In [50]:
result.shape[0]

19

il manque encore 7 entrées qui ne sont pas présentes dans les expenditures

### Trouver des informations intéressantes

1) Nous pouvons étudier si les universités qui ont augmenté la part des dépenses dans l'éducation ont aussi amélioré leur classement, et dans quelle proportion

In [51]:
df_inc = df_ees[df_ees['institute_type'].str.startswith('Higher')].groupby('country').mean()

In [52]:
lst = df_inc[df_inc['2011'] > df_inc['2010']].index.to_list()
lst

['Australia',
 'Chile',
 'Hungary',
 'Israel',
 'Japan',
 'Korea, Republic of',
 'United Kingdom',
 'United States']

Ceci est la list des pays qui ont amélioré la part de dépense dans l'éducation pour l'enseignement supérieur entre 2010 et 2011

In [53]:
df_td.query('country in @lst')

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
5,6,University of Cambridge,United Kingdom,90.5,77.7,94.1,94.0,57.0,91.2,"18,812",11.8,34%,46 : 54,2011
6,6,University of Oxford,United Kingdom,88.2,77.2,93.9,95.1,73.5,91.2,"19,919",11.6,34%,46 : 54,2011
8,9,Imperial College London,United Kingdom,89.2,90.0,94.5,88.3,92.9,90.6,"15,060",11.7,51%,37 : 63,2011
21,22,University College London,United Kingdom,74.0,90.8,81.6,80.6,39.0,78.4,"26,607",10.7,46%,56 : 44,2011
25,26,University of Tokyo,Japan,87.7,18.4,91.9,58.1,-,75.6,"26,199",5.7,10%,NaN,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2592,601-800,Waseda University,Japan,23.6,29.7,14.6,29.4,32.4,-,"52,316",16.9,8%,35 : 65,2016
2594,601-800,University of the West of England,United Kingdom,16.9,48.5,11.2,34.6,28.5,-,"22,525",21.4,15%,53 : 47,2016
2596,601-800,University of Westminster,United Kingdom,17.3,81.9,11.7,21.1,28.5,-,"16,609",21.0,43%,57 : 43,2016
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,-,"4,122",3.7,3%,NaN,2016
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,-,"10,117",12.1,8%,28 : 72,2016